In [5]:
import mysql.connector  		#importing database
database = mysql.connector.connect(
    host="localhost",
    user="root",
    password="",
    database = "class8ampython"
)
db = database.cursor()

In [6]:
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 78, 89, 78, 90, 72, 412, 80.0, 'A')
(2, 'Shyam', 89, 56, 89, 67, 76, 400, 80.0, 'A')
(3, 'Nabin', 78, 89, 78, 90, 80, 412, 80.0, 'A')
(4, 'Sabin', 78, 89, 78, 90, 80, 412, 80.0, 'A')

In [7]:
sql = "SELECT sn,name,grade FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(1, 'Ram', 'A')
(2, 'Shyam', 'A')
(3, 'Nabin', 'A')
(4, 'Sabin', 'A')

In [9]:
sql = "INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade) VALUES ('Sabin', 78, 89, 78, 90, 80, 412, 80.0, 'A')"
db.execute(sql)
database.commit()

In [20]:
n = int(input("Enter n = "))
for i in range(n):
    name = input("Enter name = ")
    physics = int(input("Enter physics = "))
    chemistry = int(input("Enter chemistry = "))
    math = int(input("Enter math = "))
    english = int(input("Enter english = "))
    nepali = int(input("Enter nepali = "))
    total = sum([physics,chemistry,math,english,nepali])
    per = total/5
    if per > 80:
        grade = 'A'
    elif per > 60:
        grade = 'B'
    elif per > 50:
        grade = 'C'
    else:
        grade = 'F'
        
    sql = f"INSERT INTO student (name, physics, chemistry, math, english, nepali, total, per, grade)  VALUES ('{name}', {physics}, {chemistry}, {math}, {english}, {nepali}, {total}, {per}, '{grade}')"
    db.execute(sql)
    
database.commit()

Enter n = 1
Enter name = Hari
Enter physics = 89
Enter chemistry = 98
Enter math = 78
Enter english = 76
Enter nepali = 78

In [10]:
sql = "DELETE FROM student WHERE sn = 1"
db.execute(sql)
database.commit()

In [12]:
sql = "DELETE FROM student WHERE name = 'Shyam'"
db.execute(sql)
database.commit()

In [13]:
sql = "SELECT sn,name,grade FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(3, 'Nabin', 'A')
(4, 'Sabin', 'A')
(5, 'Sabin', 'A')

In [16]:
sql = "SELECT * FROM student WHERE name LIKE '%na%'"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(3, 'Nabin', 78, 89, 78, 90, 80, 412, 80.0, 'A')

In [17]:
sql = "Update student SET name = 'Nabin Kumar' WHERE name = 'Nabin'"
db.execute(sql)
database.commit()

In [18]:
sql = "SELECT * FROM student"
db.execute(sql)
result =db.fetchall()
for x in result:
    print(x)

(3, 'Nabin Kumar', 78, 89, 78, 90, 80, 412, 80.0, 'A')
(4, 'Sabin', 78, 89, 78, 90, 80, 412, 80.0, 'A')
(5, 'Sabin', 78, 89, 78, 90, 80, 412, 80.0, 'A')

In [ ]:
field = input("Enter field = ")
data = input("Enter data = ")
sql = "DELETE FROM student WHERE {field} = '{data}'"
db.execute(sql)
database.commit()